**pandas series**

In [3]:
import pandas as pd

In [4]:
ser=pd.Series(data=[100,200,300],index=['a','b','c'])
ser

a    100
b    200
c    300
dtype: int64

In [5]:
ser.index

Index(['a', 'b', 'c'], dtype='object')

diffrence between numpy array and pandas is datatypes can be heterogenous

In [6]:
ser=pd.Series(data=[100,'x',300],index=['a','b','c'])
ser

a    100
b      x
c    300
dtype: object

In [7]:
ser.index

Index(['a', 'b', 'c'], dtype='object')

In [8]:
ser.loc['a']

100

In [9]:
ser[[0,2]]

a    100
c    300
dtype: object

In [10]:
ser.iloc[[0,2]]

a    100
c    300
dtype: object

In [11]:
'a' in ser

True

In [12]:
'k' in ser

False

In [13]:
ser*2 #multiplying the elements by 2

a    200
b     xx
c    600
dtype: object

In [14]:
ser[[0,2]]**2  #squaring the indexes

a    10000
c    90000
dtype: object

In [15]:
ser[['a','c']]**2

a    10000
c    90000
dtype: object

**pandas dataframe**

In [16]:
d={'one':pd.Series(data=[100,200,300,400],index=['a','b','c','x']),'two':pd.Series(data=[1,2,3,4],index=['x','y','z','a'])}

In [17]:
df=pd.DataFrame(d)
df

     one  two
a  100.0  4.0
b  200.0  NaN
c  300.0  NaN
x  400.0  1.0
y    NaN  2.0
z    NaN  3.0

In [18]:
print(df)

     one  two
a  100.0  4.0
b  200.0  NaN
c  300.0  NaN
x  400.0  1.0
y    NaN  2.0
z    NaN  3.0

In [19]:
df.index

Index(['a', 'b', 'c', 'x', 'y', 'z'], dtype='object')

In [20]:
df.columns

Index(['one', 'two'], dtype='object')

In [21]:
pd.DataFrame(d,index=['a','c','x'])

   one  two
a  100  4.0
c  300  NaN
x  400  1.0

In [22]:
pd.DataFrame(d,index=['a','c','x'],columns=['one'])

   one
a  100
c  300
x  400

In [23]:
pd.DataFrame(d,index=['a','c','x'],columns=['one','three'])

   one three
a  100   NaN
c  300   NaN
x  400   NaN

create DataFrame from list of python dictionaries

In [24]:
data=[{'a':100,'b':200},{'c':300,'d':400,'e':500}]

In [25]:
data

[{'a': 100, 'b': 200}, {'c': 300, 'd': 400, 'e': 500}]

In [26]:
pd.DataFrame(data)

       a      b      c      d      e
0  100.0  200.0    NaN    NaN    NaN
1    NaN    NaN  300.0  400.0  500.0

In [27]:
pd.DataFrame(data,index=['one','two'])

         a      b      c      d      e
one  100.0  200.0    NaN    NaN    NaN
two    NaN    NaN  300.0  400.0  500.0

In [28]:
pd.DataFrame(data,columns=['a','c'])

       a      c
0  100.0    NaN
1    NaN  300.0

DataFrame operations

In [29]:
df

     one  two
a  100.0  4.0
b  200.0  NaN
c  300.0  NaN
x  400.0  1.0
y    NaN  2.0
z    NaN  3.0

In [30]:
df['one']
print()

In [31]:
df['three']=df['one']*df['two']

In [32]:
df

     one  two  three
a  100.0  4.0  400.0
b  200.0  NaN    NaN
c  300.0  NaN    NaN
x  400.0  1.0  400.0
y    NaN  2.0    NaN
z    NaN  3.0    NaN

In [33]:
df['check']=df['one']>125

In [34]:
df

     one  two  three  check
a  100.0  4.0  400.0  False
b  200.0  NaN    NaN   True
c  300.0  NaN    NaN   True
x  400.0  1.0  400.0   True
y    NaN  2.0    NaN  False
z    NaN  3.0    NaN  False

In [35]:
out=df.pop('two')

In [36]:
df

     one  three  check
a  100.0  400.0  False
b  200.0    NaN   True
c  300.0    NaN   True
x  400.0  400.0   True
y    NaN    NaN  False
z    NaN    NaN  False

In [37]:
del df['three']

In [38]:
df

     one  check
a  100.0  False
b  200.0   True
c  300.0   True
x  400.0   True
y    NaN  False
z    NaN  False

In [39]:
df.insert(2,'copy of one',df['one'])

In [40]:
df

     one  check  copy of one
a  100.0  False        100.0
b  200.0   True        200.0
c  300.0   True        300.0
x  400.0   True        400.0
y    NaN  False          NaN
z    NaN  False          NaN

In [41]:
df['get the first two values']=df['one'][:2]

In [42]:
df

     one  check  copy of one  get the first two values
a  100.0  False        100.0                     100.0
b  200.0   True        200.0                     200.0
c  300.0   True        300.0                       NaN
x  400.0   True        400.0                       NaN
y    NaN  False          NaN                       NaN
z    NaN  False          NaN                       NaN

In [44]:
df.drop(['one','copy of one'], axis=1)

   check  get the first two values
a  False                     100.0
b   True                     200.0
c   True                       NaN
x   True                       NaN
y  False                       NaN
z  False                       NaN